{"pageProps":{"blog":{"content":"<h1 id=\"hey-there-🤗-welcome-to-my-gsoc-journey\">Hey there 🤗, Welcome to my GSoC Journey</h1>\n<p>This is a series of blogs that I am writing to share my amazing <strong>GSoC 22</strong> (Google Summer of Code 2022) Journey with you all. </p>\n<p>I was inspired towards <strong>GSoC</strong> by our Legendary Seniors - <a href=\"https://github.com/vn-ki\">Vishnu Narayan K.I.</a>  and <a href=\"https://medium.com/@priyanshuvarshney\">Priyanshu Varshney</a> - both ex-GSoCers. \nI read this <a href=\"https://medium.com/modern-fortran/first-year-of-fortran-lang-d8796bfa0067?source=user_profile---------2----------------------------\">great blog</a> by <a href=\"https://github.com/milancurcic\">Milan Curcic</a>. It touched my ❤️ and motivated me to contribute towards <strong>LFortran</strong>. I applied to <strong>GSoC</strong> this year (2022) and fortunately, I am accepted as a contributor in <strong>GSoC</strong> 2022 for the project titled <strong>LFortran: IMPLEMENTING A CUSTOM WASM BACKEND</strong> under the <strong>Fortran-Lang</strong> umbrella. I am thankful to <a href=\"https://ondrejcertik.com/\">Ondřej Čertík</a> for believing in me and for giving me this wonderful opportunity.</p>\n<h1 id=\"starting-to-start\">Starting to Start</h1>\n<p>It all started with the following:</p>\n<p><img alt=\"gsoc_start_mail\" src=\"/imgs/gsoc_start_mail.png\">\n<img alt=\"gsoc_start_mail_response\" src=\"/imgs/gsoc_start_mail_response.png\"></p>\n<p>Thanks to Ondřej, after installing <code>llvm 11.0</code>, all the tests ran successfully and the code-setup was successful. </p>\n<h2 id=\"misellaneous-setup\">Misellaneous Setup</h2>\n<p>From past few years, I used to use <strong>HTTPS</strong> for <em>git push</em> and <em>pull</em>. It seems, since recently, <strong>HTTPS</strong> has been deprecated and we need to use <strong>SSH</strong> to be able to push and pull changes. For setting up <strong>SSH</strong>, we need to generate public-private key pair, out of which the public-key is to be uploaded to GitHub/GitLab and private key is kept at (by default)<code>~/.ssh</code>. Hopefully, this setup was also completed successfully.</p>\n<h2 id=\"first-learning\">First Learning</h2>\n<p>Initially, I added a test case related to <code>minval</code> and <code>maxval</code> array intrinsic functions. Now, comes the hard part for me. I was a bit inexperienced with using <code>git</code>. I guess I mostly knew two <code>git</code> commands - <code>git pull</code> and <code>git push</code>. I did knew how to fork and and how to commit and push changes (I got to learn this by participating in <a href=\"https://hacktoberfest.digitalocean.com/\">Hacktoberfest</a> 2019), but did not know how to pull changes from the original repository.</p>\n<p>From <a href=\"https://stackoverflow.com/a/9257901/11474769\">here</a>, I learnt that we can:</p>\n<ul>\n<li>first fork the repo (the forked remote repo is called origin)</li>\n<li>clone the forked repo using <code>git clone &lt;clone-link-to-forked-repo&gt;</code></li>\n<li>checkout a new branch to make changes to using <code>git checkout -b my_new_branch</code></li>\n<li>make updates, add, commit files and push to the forked repo (that is the origin repo) using <code>git push origin my_new_branch</code></li>\n<li>go to the root directory of the original repo and select button/option <strong>create merge reques</strong></li>\n</ul>\n<p>Now, to be able to pull changes from the (original repo)</p>\n<ul>\n<li>we first add the original repo as upstream repo using <code>git remote add upstream &lt;clone-link-to-original-repo&gt;</code></li>\n<li>checkout to master (if not in master) using <code>git checkout master</code></li>\n<li>pull the changes from upstream using <code>git pull --rebase upstream master</code></li>\n</ul>\n<p>Hola! We now are able to pull and push changes from and to the original repository.</p>\n<p><strong>PS:</strong> It seems the above approach it not right. \nThe right approach probably is to have the original repository as the origin and the forked repository named as upstream or (better) as our git username.</p>\n<p>So, the commands would in this case be</p>\n<pre><code class=\"hljs language-bash\">git pull --rebase origin master // to fetch latest changes\ngit push shaikhubaid769 feature_branch // to push changes\n</code></pre>\n<hr>\n<p>That's all for this blog. Thank you for your time. We continue this series in the next blog.</p>\n","frontmatter":{"slug":"gsoc_0_starting_to_start","excerpt":"My GSoC 2022 Journey started this way ...","title":"GSoC 22: Starting to Start","publishedAt":"2022-06-06","day":"June 6, 2022","readingTime":"3 min read"}}},"__N_SSG":true}